Revit 2027 API
NumberingParameterType Enumeration
 Defines types for numbering parameter associations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NumberingParameterType
Public Enumeration NumberingParameterType
public enum class NumberingParameterType
type NumberingParameterType
Members
Member name | Value | Description
Analytical | 1 |  The parameter belongs to the analytical element associated with this element.
FromRoom | 4 |  The parameter belongs to the room that associates this element as an out.
MemberForces | 2 |  The parameter belongs to the member force element associated with this element.
Native | 0 |  The parameter belongs to the element or to the type of the element.
Physical | 6 |  The parameter belongs to the physical element associated with this element.
Room | 9 |  The parameter belongs to the room contains that element.
StructuralMaterial | 8 |  The parameter belongs to the structural material associated with this element.
StructuralSection | 7 |  The parameter belongs to the structural section associated with this element.
ToRoom | 5 |  The parameter belongs to the room that associates this element as an in.
Unknown | 10 |  The parameter does not belong to any associations for this category.
See Also
Reference
Autodesk.Revit.DB Namespace